Revit 2026 API

# CurtainGrid Class

---

Represents a curtain grid element within Autodesk Revit.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBCurtainGrid

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CurtainGrid : APIObject
```
```vb
Public Class CurtainGrid
	Inherits APIObject
```
```cpp
public ref class CurtainGrid : public APIObject
```
```fsharp
type CurtainGrid =
    class
        inherit APIObject
    end
```

The CurtainGrid type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Grid1Angle | The angle for the U grid line pattern of the curtain grid. |
|  | Grid1Justification | The justification for the U grid line pattern of the curtain grid. |
|  | Grid1Offset | The offset for the U grid line pattern of the curtain grid. |
|  | Grid2Angle | The angle for V grid line pattern of the curtain grid. |
|  | Grid2Justification | The justification for the V grid line pattern of the curtain grid. |
|  | Grid2Offset | The offset for V grid line pattern of the curtain grid. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | NumPanels | The number of panels. |
|  | NumULines | Get the number of grid lines in the U direction. |
|  | NumVLines | Get the number of grid lines in the V direction. |

|  | Name | Description |
| --- | --- | --- |
|  | AddGridLine | Add a grid line to the curtain grid. |
|  | ChangePanelType | Change the type of a curtain panel. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCell | Get the specified cell located by the intersection of the grid lines. |
|  | GetCurtainCells | Gets the CurtainCells owned by this curtain grid. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetMullionIds | Gets all ElementIds of the mullions of the curtain grid. |
|  | GetPanel | Get the specified panel located by the intersection of the grid lines. |
|  | GetPanelIds | Gets all ElementIds of the panels of the curtain grid. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetUGridLineIds | Gets all ElementIds of grid lines in the U direction. |
|  | GetUnlockedMullionIds | Gets all ElementIds of the unlocked mullions of the curtain grid. |
|  | GetUnlockedPanelIds | Gets all ElementIds of the unlocked panels of the curtain grid. |
|  | GetVGridLineIds | Gets all ElementIds of grid lines in the V direction. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This element is obtained from a curtain wall, curtain system, or curtain roof. A curtain wall has only one curtain grid, while a curtain system or curtain roof may have several curtain grids.

#### Reference

Autodesk.Revit.DB Namespace